;Expert Advisor visual test: 2, XAGUSD H1, every tick, 2020.01.01 - 2024.11.19
[Tester]
Expert=2.ex5
Symbol=XAGUSD
Period=H1
Optimization=0
Model=0
FromDate=2020.01.01
ToDate=2024.11.19
ForwardMode=0
Deposit=10000
Currency=USD
ProfitInPips=0
Leverage=1000
ExecutionMode=0
OptimizationCriterion=0
Visual=1
[TesterInputs]
____1___=Настройки индикатора ZigZag
ExtDepth=12||12||1||120||N
ExtDeviation=5||5||1||50||N
ExtBackstep=3||3||1||30||N
____2___=Время работы советника
StartHour=0||0||1||10||N
StartMinute=1||1||1||10||N
StopHour=23||23||1||230||N
StopMinute=59||59||1||590||N
____3___=Настройки коридора и отступа
N_pips=5||5||1||50||N
Min_Corridor=20||20||1||200||N
Max_Corridor=100||100||1||1000||N
____4___=Настройки ММ
InpLots=0.0||0.0||0.000000||0.000000||N
Risk=5.0||5.0||0.500000||50.000000||N
_____5_____=Настройки советника
Fibo_StopLoss=4||0||0||8||N
Fibo_TakeProfit=6||0||0||8||N
InpTrailingStop=5||5||1||50||N
InpTrailingStep=5||5||1||50||N
Line=false||false||0||true||N
m_magic=154897||154897||1||1548970||N
